# ModelCurve Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurve Class
Members See Also
---
A model element that exists in 3D space and is visible in all views of a Revit project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ModelCurve : CurveElement
```

Visual Basic
---
```text
Public Class ModelCurve _
	Inherits CurveElement
```

Visual C++
---
```text
public ref class ModelCurve : public CurveElement
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..CurveElement Autodesk.Revit.DB..::..ModelCurve Autodesk.Revit.DB..::..ModelArc Autodesk.Revit.DB..::..ModelEllipse Autodesk.Revit.DB..::..ModelHermiteSpline Autodesk.Revit.DB..::..ModelLine Autodesk.Revit.DB..::..ModelNurbSpline
# See Also
ModelCurve Members
Autodesk.Revit.DB Namespace